MikroElektronika/core_packages/PIC/XC8/def/PIC18LF57K42/mcu.h
extern volatile NCO1INCHbits_t NCO1INCHbits __at(0x3F3C);
// bitfield macros
#define _NCO1INCH_INC_POSN                                  0x0
#define _NCO1INCH_INC_POSITION                              0x0
#define _NCO1INCH_INC_SIZE                                  0x8
#define _NCO1INCH_INC_LENGTH                                0x8
#define _NCO1INCH_INC_MASK                                  0xFF
#define _NCO1INCH_NCO1INC8_POSN                             0x0
#define _NCO1INCH_NCO1INC8_POSITION                         0x0
#define _NCO1INCH_NCO1INC8_SIZE                             0x1
#define _NCO1INCH_NCO1INC8_LENGTH                           0x1
#define _NCO1INCH_NCO1INC8_MASK                             0x1
#define _NCO1INCH_NCO1INC9_POSN                             0x1
#define _NCO1INCH_NCO1INC9_POSITION                         0x1
#define _NCO1INCH_NCO1INC9_SIZE                             0x1
#define _NCO1INCH_NCO1INC9_LENGTH                           0x1
#define _NCO1INCH_NCO1INC9_MASK                             0x2
#define _NCO1INCH_NCO1INC10_POSN                            0x2
#define _NCO1INCH_NCO1INC10_POSITION                        0x2
#define _NCO1INCH_NCO1INC10_SIZE                            0x1
#define _NCO1INCH_NCO1INC10_LENGTH                          0x1
#define _NCO1INCH_NCO1INC10_MASK                            0x4
#define _NCO1INCH_NCO1INC11_POSN                            0x3
#define _NCO1INCH_NCO1INC11_POSITION                        0x3
#define _NCO1INCH_NCO1INC11_SIZE                            0x1
#define _NCO1INCH_NCO1INC11_LENGTH                          0x1
#define _NCO1INCH_NCO1INC11_MASK                            0x8
#define _NCO1INCH_NCO1INC12_POSN                            0x4
#define _NCO1INCH_NCO1INC12_POSITION                        0x4
#define _NCO1INCH_NCO1INC12_SIZE                            0x1
#define _NCO1INCH_NCO1INC12_LENGTH                          0x1
#define _NCO1INCH_NCO1INC12_MASK                            0x10
#define _NCO1INCH_NCO1INC13_POSN                            0x5
#define _NCO1INCH_NCO1INC13_POSITION                        0x5
#define _NCO1INCH_NCO1INC13_SIZE                            0x1
#define _NCO1INCH_NCO1INC13_LENGTH                          0x1
#define _NCO1INCH_NCO1INC13_MASK                            0x20
#define _NCO1INCH_NCO1INC14_POSN                            0x6
#define _NCO1INCH_NCO1INC14_POSITION                        0x6
#define _NCO1INCH_NCO1INC14_SIZE                            0x1
#define _NCO1INCH_NCO1INC14_LENGTH                          0x1
#define _NCO1INCH_NCO1INC14_MASK                            0x40
#define _NCO1INCH_NCO1INC15_POSN                            0x7
#define _NCO1INCH_NCO1INC15_POSITION                        0x7
#define _NCO1INCH_NCO1INC15_SIZE                            0x1
#define _NCO1INCH_NCO1INC15_LENGTH                          0x1
#define _NCO1INCH_NCO1INC15_MASK                            0x80
#define _NCO1INCH_INC8_POSN                                 0x0
#define _NCO1INCH_INC8_POSITION                             0x0
#define _NCO1INCH_INC8_SIZE                                 0x1
#define _NCO1INCH_INC8_LENGTH                               0x1
#define _NCO1INCH_INC8_MASK                                 0x1
#define _NCO1INCH_INC9_POSN                                 0x1
#define _NCO1INCH_INC9_POSITION                             0x1
#define _NCO1INCH_INC9_SIZE                                 0x1
#define _NCO1INCH_INC9_LENGTH                               0x1
#define _NCO1INCH_INC9_MASK                                 0x2
#define _NCO1INCH_INC10_POSN                                0x2
#define _NCO1INCH_INC10_POSITION                            0x2
#define _NCO1INCH_INC10_SIZE                                0x1
#define _NCO1INCH_INC10_LENGTH                              0x1
#define _NCO1INCH_INC10_MASK                                0x4
#define _NCO1INCH_INC11_POSN                                0x3
#define _NCO1INCH_INC11_POSITION                            0x3
#define _NCO1INCH_INC11_SIZE                                0x1
#define _NCO1INCH_INC11_LENGTH                              0x1
#define _NCO1INCH_INC11_MASK                                0x8
#define _NCO1INCH_INC12_POSN                                0x4
#define _NCO1INCH_INC12_POSITION                            0x4
#define _NCO1INCH_INC12_SIZE                                0x1
#define _NCO1INCH_INC12_LENGTH                              0x1
#define _NCO1INCH_INC12_MASK                                0x10
#define _NCO1INCH_INC13_POSN                                0x5
#define _NCO1INCH_INC13_POSITION                            0x5
#define _NCO1INCH_INC13_SIZE                                0x1
#define _NCO1INCH_INC13_LENGTH                              0x1
#define _NCO1INCH_INC13_MASK                                0x20
#define _NCO1INCH_INC14_POSN                                0x6
#define _NCO1INCH_INC14_POSITION                            0x6
#define _NCO1INCH_INC14_SIZE                                0x1
#define _NCO1INCH_INC14_LENGTH                              0x1
#define _NCO1INCH_INC14_MASK                                0x40
#define _NCO1INCH_INC15_POSN                                0x7
#define _NCO1INCH_INC15_POSITION                            0x7
#define _NCO1INCH_INC15_SIZE                                0x1
#define _NCO1INCH_INC15_LENGTH                              0x1
#define _NCO1INCH_INC15_MASK                                0x80
#define _NCO1INCH_NCO1INC_POSN                              0x0
#define _NCO1INCH_NCO1INC_POSITION                          0x0
#define _NCO1INCH_NCO1INC_SIZE                              0x8
#define _NCO1INCH_NCO1INC_LENGTH                            0x8
#define _NCO1INCH_NCO1INC_MASK                              0xFF

// Register: NCO1INCU
#define NCO1INCU NCO1INCU
extern volatile unsigned char           NCO1INCU            __at(0x3F3D);
#ifndef _LIB_BUILD
asm("NCO1INCU equ 03F3Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INC                    :4;
    };
    struct {
        unsigned NCO1INC16              :1;
        unsigned NCO1INC17              :1;
        unsigned NCO1INC18              :1;
        unsigned NCO1INC19              :1;
    };
    struct {
        unsigned INC16                  :1;
        unsigned INC17                  :1;
        unsigned INC18                  :1;
        unsigned INC19                  :1;
    };
    struct {
        unsigned NCO1INC                :4;
    };
} NCO1INCUbits_t;
