MikroElektronika/core_packages/PIC/XC8/def/PIC18LF57K42/mcu.h
extern volatile TMR5CLKbits_t TMR5CLKbits __at(0x3F9D);
// bitfield macros
#define _TMR5CLK_CS_POSN                                    0x0
#define _TMR5CLK_CS_POSITION                                0x0
#define _TMR5CLK_CS_SIZE                                    0x8
#define _TMR5CLK_CS_LENGTH                                  0x8
#define _TMR5CLK_CS_MASK                                    0xFF
#define _TMR5CLK_T5CS0_POSN                                 0x0
#define _TMR5CLK_T5CS0_POSITION                             0x0
#define _TMR5CLK_T5CS0_SIZE                                 0x1
#define _TMR5CLK_T5CS0_LENGTH                               0x1
#define _TMR5CLK_T5CS0_MASK                                 0x1
#define _TMR5CLK_T5CS1_POSN                                 0x1
#define _TMR5CLK_T5CS1_POSITION                             0x1
#define _TMR5CLK_T5CS1_SIZE                                 0x1
#define _TMR5CLK_T5CS1_LENGTH                               0x1
#define _TMR5CLK_T5CS1_MASK                                 0x2
#define _TMR5CLK_T5CS2_POSN                                 0x2
#define _TMR5CLK_T5CS2_POSITION                             0x2
#define _TMR5CLK_T5CS2_SIZE                                 0x1
#define _TMR5CLK_T5CS2_LENGTH                               0x1
#define _TMR5CLK_T5CS2_MASK                                 0x4
#define _TMR5CLK_T5CS3_POSN                                 0x3
#define _TMR5CLK_T5CS3_POSITION                             0x3
#define _TMR5CLK_T5CS3_SIZE                                 0x1
#define _TMR5CLK_T5CS3_LENGTH                               0x1
#define _TMR5CLK_T5CS3_MASK                                 0x8
#define _TMR5CLK_T5CS4_POSN                                 0x4
#define _TMR5CLK_T5CS4_POSITION                             0x4
#define _TMR5CLK_T5CS4_SIZE                                 0x1
#define _TMR5CLK_T5CS4_LENGTH                               0x1
#define _TMR5CLK_T5CS4_MASK                                 0x10
#define _TMR5CLK_CS0_POSN                                   0x0
#define _TMR5CLK_CS0_POSITION                               0x0
#define _TMR5CLK_CS0_SIZE                                   0x1
#define _TMR5CLK_CS0_LENGTH                                 0x1
#define _TMR5CLK_CS0_MASK                                   0x1
#define _TMR5CLK_CS1_POSN                                   0x1
#define _TMR5CLK_CS1_POSITION                               0x1
#define _TMR5CLK_CS1_SIZE                                   0x1
#define _TMR5CLK_CS1_LENGTH                                 0x1
#define _TMR5CLK_CS1_MASK                                   0x2
#define _TMR5CLK_CS2_POSN                                   0x2
#define _TMR5CLK_CS2_POSITION                               0x2
#define _TMR5CLK_CS2_SIZE                                   0x1
#define _TMR5CLK_CS2_LENGTH                                 0x1
#define _TMR5CLK_CS2_MASK                                   0x4
#define _TMR5CLK_CS3_POSN                                   0x3
#define _TMR5CLK_CS3_POSITION                               0x3
#define _TMR5CLK_CS3_SIZE                                   0x1
#define _TMR5CLK_CS3_LENGTH                                 0x1
#define _TMR5CLK_CS3_MASK                                   0x8
#define _TMR5CLK_CS4_POSN                                   0x4
#define _TMR5CLK_CS4_POSITION                               0x4
#define _TMR5CLK_CS4_SIZE                                   0x1
#define _TMR5CLK_CS4_LENGTH                                 0x1
#define _TMR5CLK_CS4_MASK                                   0x10
typedef union {
    struct {
        unsigned CS                     :8;
    };
    struct {
        unsigned T5CS0                  :1;
        unsigned T5CS1                  :1;
        unsigned T5CS2                  :1;
        unsigned T5CS3                  :1;
        unsigned T5CS4                  :1;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
        unsigned CS4                    :1;
    };
} PR5bits_t;
extern volatile PR5bits_t PR5bits __at(0x3F9D);
// bitfield macros
#define _PR5_CS_POSN                                        0x0
#define _PR5_CS_POSITION                                    0x0
#define _PR5_CS_SIZE                                        0x8
#define _PR5_CS_LENGTH                                      0x8
#define _PR5_CS_MASK                                        0xFF
#define _PR5_T5CS0_POSN                                     0x0
#define _PR5_T5CS0_POSITION                                 0x0
#define _PR5_T5CS0_SIZE                                     0x1
#define _PR5_T5CS0_LENGTH                                   0x1
#define _PR5_T5CS0_MASK                                     0x1
#define _PR5_T5CS1_POSN                                     0x1
#define _PR5_T5CS1_POSITION                                 0x1
#define _PR5_T5CS1_SIZE                                     0x1
#define _PR5_T5CS1_LENGTH                                   0x1
#define _PR5_T5CS1_MASK                                     0x2
#define _PR5_T5CS2_POSN                                     0x2
#define _PR5_T5CS2_POSITION                                 0x2
#define _PR5_T5CS2_SIZE                                     0x1
#define _PR5_T5CS2_LENGTH                                   0x1
#define _PR5_T5CS2_MASK                                     0x4
#define _PR5_T5CS3_POSN                                     0x3
#define _PR5_T5CS3_POSITION                                 0x3
#define _PR5_T5CS3_SIZE                                     0x1
#define _PR5_T5CS3_LENGTH                                   0x1
#define _PR5_T5CS3_MASK                                     0x8
#define _PR5_T5CS4_POSN                                     0x4
#define _PR5_T5CS4_POSITION                                 0x4
#define _PR5_T5CS4_SIZE                                     0x1
#define _PR5_T5CS4_LENGTH                                   0x1
#define _PR5_T5CS4_MASK                                     0x10
#define _PR5_CS0_POSN                                       0x0
#define _PR5_CS0_POSITION                                   0x0
#define _PR5_CS0_SIZE                                       0x1
#define _PR5_CS0_LENGTH                                     0x1
#define _PR5_CS0_MASK                                       0x1
#define _PR5_CS1_POSN                                       0x1
#define _PR5_CS1_POSITION                                   0x1
#define _PR5_CS1_SIZE                                       0x1
#define _PR5_CS1_LENGTH                                     0x1
#define _PR5_CS1_MASK                                       0x2
#define _PR5_CS2_POSN                                       0x2
#define _PR5_CS2_POSITION                                   0x2
#define _PR5_CS2_SIZE                                       0x1
#define _PR5_CS2_LENGTH                                     0x1
#define _PR5_CS2_MASK                                       0x4
#define _PR5_CS3_POSN                                       0x3
#define _PR5_CS3_POSITION                                   0x3
#define _PR5_CS3_SIZE                                       0x1
#define _PR5_CS3_LENGTH                                     0x1
#define _PR5_CS3_MASK                                       0x8
#define _PR5_CS4_POSN                                       0x4
#define _PR5_CS4_POSITION                                   0x4
#define _PR5_CS4_SIZE                                       0x1
#define _PR5_CS4_LENGTH                                     0x1
#define _PR5_CS4_MASK                                       0x10

// Register: T4TMR
#define T4TMR T4TMR
extern volatile unsigned char           T4TMR               __at(0x3F9E);
#ifndef _LIB_BUILD
asm("T4TMR equ 03F9Eh");
#endif
// aliases
extern volatile unsigned char           TMR4                __at(0x3F9E);
#ifndef _LIB_BUILD
asm("TMR4 equ 03F9Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR4                   :8;
    };
} T4TMRbits_t;
extern volatile T4TMRbits_t T4TMRbits __at(0x3F9E);
// bitfield macros
#define _T4TMR_TMR4_POSN                                    0x0
#define _T4TMR_TMR4_POSITION                                0x0
#define _T4TMR_TMR4_SIZE                                    0x8
#define _T4TMR_TMR4_LENGTH                                  0x8
#define _T4TMR_TMR4_MASK                                    0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TMR4                   :8;
    };
} TMR4bits_t;
extern volatile TMR4bits_t TMR4bits __at(0x3F9E);
// bitfield macros
#define _TMR4_TMR4_POSN                                     0x0
#define _TMR4_TMR4_POSITION                                 0x0
#define _TMR4_TMR4_SIZE                                     0x8
#define _TMR4_TMR4_LENGTH                                   0x8
#define _TMR4_TMR4_MASK                                     0xFF

// Register: T4PR
#define T4PR T4PR
extern volatile unsigned char           T4PR                __at(0x3F9F);
#ifndef _LIB_BUILD
asm("T4PR equ 03F9Fh");
#endif
// aliases
extern volatile unsigned char           _PR4                 __at(0x3F9F);  // Note: Changed by MikroE
#ifndef _LIB_BUILD
asm("_PR4 equ 03F9Fh");  // Note: Changed by MikroE
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned _PR4                    :8;  // Note: Changed by MikroE
    };
} T4PRbits_t;
extern volatile T4PRbits_t T4PRbits __at(0x3F9F);
// bitfield macros
#define _T4PR_PR4_POSN                                      0x0
#define _T4PR_PR4_POSITION                                  0x0
#define _T4PR_PR4_SIZE                                      0x8
#define _T4PR_PR4_LENGTH                                    0x8
#define _T4PR_PR4_MASK                                      0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned _PR4                    :8;  // Note: Changed by MikroE
    };
} PR4bits_t;
extern volatile PR4bits_t PR4bits __at(0x3F9F);
// bitfield macros
#define _PR4_PR4_POSN                                       0x0
#define _PR4_PR4_POSITION                                   0x0
#define _PR4_PR4_SIZE                                       0x8
#define _PR4_PR4_LENGTH                                     0x8
#define _PR4_PR4_MASK                                       0xFF

// Register: T4CON
#define T4CON T4CON
extern volatile unsigned char           T4CON               __at(0x3FA0);
#ifndef _LIB_BUILD
asm("T4CON equ 03FA0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OUTPS                  :4;
        unsigned CKPS                   :3;
        unsigned ON                     :1;
    };
    struct {
        unsigned T4OUTPS                :4;
        unsigned T4CKPS                 :3;
        unsigned T4ON                   :1;
    };
    struct {
        unsigned T4OUTPS0               :1;
        unsigned T4OUTPS1               :1;
        unsigned T4OUTPS2               :1;
        unsigned T4OUTPS3               :1;
        unsigned T4CKPS0                :1;
        unsigned T4CKPS1                :1;
        unsigned T4CKPS2                :1;
    };
    struct {
        unsigned OUTPS0                 :1;
        unsigned OUTPS1                 :1;
        unsigned OUTPS2                 :1;
        unsigned OUTPS3                 :1;
        unsigned CKPS0                  :1;
        unsigned CKPS1                  :1;
        unsigned CKPS2                  :1;
        unsigned TMR4ON                 :1;
    };
} T4CONbits_t;
extern volatile T4CONbits_t T4CONbits __at(0x3FA0);
// bitfield macros
#define _T4CON_OUTPS_POSN                                   0x0
#define _T4CON_OUTPS_POSITION                               0x0
#define _T4CON_OUTPS_SIZE                                   0x4
#define _T4CON_OUTPS_LENGTH                                 0x4
#define _T4CON_OUTPS_MASK                                   0xF
#define _T4CON_CKPS_POSN                                    0x4
#define _T4CON_CKPS_POSITION                                0x4
#define _T4CON_CKPS_SIZE                                    0x3
#define _T4CON_CKPS_LENGTH                                  0x3
#define _T4CON_CKPS_MASK                                    0x70
#define _T4CON_ON_POSN                                      0x7
#define _T4CON_ON_POSITION                                  0x7
#define _T4CON_ON_SIZE                                      0x1
#define _T4CON_ON_LENGTH                                    0x1
#define _T4CON_ON_MASK                                      0x80
#define _T4CON_T4OUTPS_POSN                                 0x0
#define _T4CON_T4OUTPS_POSITION                             0x0
#define _T4CON_T4OUTPS_SIZE                                 0x4
#define _T4CON_T4OUTPS_LENGTH                               0x4
#define _T4CON_T4OUTPS_MASK                                 0xF
#define _T4CON_T4CKPS_POSN                                  0x4
#define _T4CON_T4CKPS_POSITION                              0x4
#define _T4CON_T4CKPS_SIZE                                  0x3
#define _T4CON_T4CKPS_LENGTH                                0x3
#define _T4CON_T4CKPS_MASK                                  0x70
#define _T4CON_T4ON_POSN                                    0x7
#define _T4CON_T4ON_POSITION                                0x7
#define _T4CON_T4ON_SIZE                                    0x1
#define _T4CON_T4ON_LENGTH                                  0x1
#define _T4CON_T4ON_MASK                                    0x80
#define _T4CON_T4OUTPS0_POSN                                0x0
#define _T4CON_T4OUTPS0_POSITION                            0x0
#define _T4CON_T4OUTPS0_SIZE                                0x1
#define _T4CON_T4OUTPS0_LENGTH                              0x1
#define _T4CON_T4OUTPS0_MASK                                0x1
#define _T4CON_T4OUTPS1_POSN                                0x1
#define _T4CON_T4OUTPS1_POSITION                            0x1
#define _T4CON_T4OUTPS1_SIZE                                0x1
#define _T4CON_T4OUTPS1_LENGTH                              0x1
#define _T4CON_T4OUTPS1_MASK                                0x2
#define _T4CON_T4OUTPS2_POSN                                0x2
#define _T4CON_T4OUTPS2_POSITION                            0x2
#define _T4CON_T4OUTPS2_SIZE                                0x1
#define _T4CON_T4OUTPS2_LENGTH                              0x1
#define _T4CON_T4OUTPS2_MASK                                0x4
#define _T4CON_T4OUTPS3_POSN                                0x3
#define _T4CON_T4OUTPS3_POSITION                            0x3
#define _T4CON_T4OUTPS3_SIZE                                0x1
#define _T4CON_T4OUTPS3_LENGTH                              0x1
#define _T4CON_T4OUTPS3_MASK                                0x8
#define _T4CON_T4CKPS0_POSN                                 0x4
#define _T4CON_T4CKPS0_POSITION                             0x4
#define _T4CON_T4CKPS0_SIZE                                 0x1
#define _T4CON_T4CKPS0_LENGTH                               0x1
#define _T4CON_T4CKPS0_MASK                                 0x10
#define _T4CON_T4CKPS1_POSN                                 0x5
#define _T4CON_T4CKPS1_POSITION                             0x5
#define _T4CON_T4CKPS1_SIZE                                 0x1
#define _T4CON_T4CKPS1_LENGTH                               0x1
#define _T4CON_T4CKPS1_MASK                                 0x20
#define _T4CON_T4CKPS2_POSN                                 0x6
#define _T4CON_T4CKPS2_POSITION                             0x6
#define _T4CON_T4CKPS2_SIZE                                 0x1
#define _T4CON_T4CKPS2_LENGTH                               0x1
#define _T4CON_T4CKPS2_MASK                                 0x40
#define _T4CON_OUTPS0_POSN                                  0x0
#define _T4CON_OUTPS0_POSITION                              0x0
#define _T4CON_OUTPS0_SIZE                                  0x1
#define _T4CON_OUTPS0_LENGTH                                0x1
#define _T4CON_OUTPS0_MASK                                  0x1
#define _T4CON_OUTPS1_POSN                                  0x1
#define _T4CON_OUTPS1_POSITION                              0x1
#define _T4CON_OUTPS1_SIZE                                  0x1
#define _T4CON_OUTPS1_LENGTH                                0x1
#define _T4CON_OUTPS1_MASK                                  0x2
#define _T4CON_OUTPS2_POSN                                  0x2
#define _T4CON_OUTPS2_POSITION                              0x2
#define _T4CON_OUTPS2_SIZE                                  0x1
#define _T4CON_OUTPS2_LENGTH                                0x1
#define _T4CON_OUTPS2_MASK                                  0x4
#define _T4CON_OUTPS3_POSN                                  0x3
#define _T4CON_OUTPS3_POSITION                              0x3
#define _T4CON_OUTPS3_SIZE                                  0x1
#define _T4CON_OUTPS3_LENGTH                                0x1
#define _T4CON_OUTPS3_MASK                                  0x8
#define _T4CON_CKPS0_POSN                                   0x4
#define _T4CON_CKPS0_POSITION                               0x4
#define _T4CON_CKPS0_SIZE                                   0x1
#define _T4CON_CKPS0_LENGTH                                 0x1
#define _T4CON_CKPS0_MASK                                   0x10
#define _T4CON_CKPS1_POSN                                   0x5
#define _T4CON_CKPS1_POSITION                               0x5
#define _T4CON_CKPS1_SIZE                                   0x1
#define _T4CON_CKPS1_LENGTH                                 0x1
#define _T4CON_CKPS1_MASK                                   0x20
#define _T4CON_CKPS2_POSN                                   0x6
#define _T4CON_CKPS2_POSITION                               0x6
#define _T4CON_CKPS2_SIZE                                   0x1
#define _T4CON_CKPS2_LENGTH                                 0x1
#define _T4CON_CKPS2_MASK                                   0x40
#define _T4CON_TMR4ON_POSN                                  0x7
#define _T4CON_TMR4ON_POSITION                              0x7
#define _T4CON_TMR4ON_SIZE                                  0x1
#define _T4CON_TMR4ON_LENGTH                                0x1
#define _T4CON_TMR4ON_MASK                                  0x80

// Register: T4HLT
#define T4HLT T4HLT
extern volatile unsigned char           T4HLT               __at(0x3FA1);
#ifndef _LIB_BUILD
asm("T4HLT equ 03FA1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :5;
        unsigned CKSYNC                 :1;
        unsigned CKPOL                  :1;
        unsigned PSYNC                  :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned MODE3                  :1;
        unsigned MODE4                  :1;
    };
    struct {
        unsigned T4MODE                 :5;
        unsigned T4CKSYNC               :1;
        unsigned T4CKPOL                :1;
        unsigned T4PSYNC                :1;
    };
    struct {
        unsigned T4MODE0                :1;
        unsigned T4MODE1                :1;
        unsigned T4MODE2                :1;
        unsigned T4MODE3                :1;
        unsigned T4MODE4                :1;
    };
} T4HLTbits_t;
