MikroElektronika/core_packages/PIC/XC8/def/PIC18LF57K42/mcu.h
#define                                 DMA1SPTR19_bit      _BIT_ACCESS(DMA1SPTRU,3)
// DMA1SPTRL<DMA1SPTR2>
extern volatile __bit                   DMA1SPTR2           __at(0x1DFA2);	// @ (0x3BF4 * 8 + 2)
#define                                 DMA1SPTR2_bit       _BIT_ACCESS(DMA1SPTRL,2)
// DMA1SPTRU<DMA1SPTR20>
extern volatile __bit                   DMA1SPTR20          __at(0x1DFB4);	// @ (0x3BF6 * 8 + 4)
#define                                 DMA1SPTR20_bit      _BIT_ACCESS(DMA1SPTRU,4)
// DMA1SPTRU<DMA1SPTR21>
extern volatile __bit                   DMA1SPTR21          __at(0x1DFB5);	// @ (0x3BF6 * 8 + 5)
#define                                 DMA1SPTR21_bit      _BIT_ACCESS(DMA1SPTRU,5)
// DMA1SPTRL<DMA1SPTR3>
extern volatile __bit                   DMA1SPTR3           __at(0x1DFA3);	// @ (0x3BF4 * 8 + 3)
#define                                 DMA1SPTR3_bit       _BIT_ACCESS(DMA1SPTRL,3)
// DMA1SPTRL<DMA1SPTR4>
extern volatile __bit                   DMA1SPTR4           __at(0x1DFA4);	// @ (0x3BF4 * 8 + 4)
#define                                 DMA1SPTR4_bit       _BIT_ACCESS(DMA1SPTRL,4)
// DMA1SPTRL<DMA1SPTR5>
extern volatile __bit                   DMA1SPTR5           __at(0x1DFA5);	// @ (0x3BF4 * 8 + 5)
#define                                 DMA1SPTR5_bit       _BIT_ACCESS(DMA1SPTRL,5)
// DMA1SPTRL<DMA1SPTR6>
extern volatile __bit                   DMA1SPTR6           __at(0x1DFA6);	// @ (0x3BF4 * 8 + 6)
#define                                 DMA1SPTR6_bit       _BIT_ACCESS(DMA1SPTRL,6)
// DMA1SPTRL<DMA1SPTR7>
extern volatile __bit                   DMA1SPTR7           __at(0x1DFA7);	// @ (0x3BF4 * 8 + 7)
#define                                 DMA1SPTR7_bit       _BIT_ACCESS(DMA1SPTRL,7)
// DMA1SPTRH<DMA1SPTR8>
extern volatile __bit                   DMA1SPTR8           __at(0x1DFA8);	// @ (0x3BF5 * 8 + 0)
#define                                 DMA1SPTR8_bit       _BIT_ACCESS(DMA1SPTRH,0)
// DMA1SPTRH<DMA1SPTR9>
extern volatile __bit                   DMA1SPTR9           __at(0x1DFA9);	// @ (0x3BF5 * 8 + 1)
#define                                 DMA1SPTR9_bit       _BIT_ACCESS(DMA1SPTRH,1)
// DMA1SSAL<DMA1SSA0>
extern volatile __bit                   DMA1SSA0            __at(0x1DFC8);	// @ (0x3BF9 * 8 + 0)
#define                                 DMA1SSA0_bit        _BIT_ACCESS(DMA1SSAL,0)
// DMA1SSAL<DMA1SSA1>
extern volatile __bit                   DMA1SSA1            __at(0x1DFC9);	// @ (0x3BF9 * 8 + 1)
#define                                 DMA1SSA1_bit        _BIT_ACCESS(DMA1SSAL,1)
// DMA1SSAH<DMA1SSA10>
extern volatile __bit                   DMA1SSA10           __at(0x1DFD2);	// @ (0x3BFA * 8 + 2)
#define                                 DMA1SSA10_bit       _BIT_ACCESS(DMA1SSAH,2)
// DMA1SSAH<DMA1SSA11>
extern volatile __bit                   DMA1SSA11           __at(0x1DFD3);	// @ (0x3BFA * 8 + 3)
#define                                 DMA1SSA11_bit       _BIT_ACCESS(DMA1SSAH,3)
// DMA1SSAH<DMA1SSA12>
extern volatile __bit                   DMA1SSA12           __at(0x1DFD4);	// @ (0x3BFA * 8 + 4)
#define                                 DMA1SSA12_bit       _BIT_ACCESS(DMA1SSAH,4)
// DMA1SSAH<DMA1SSA13>
extern volatile __bit                   DMA1SSA13           __at(0x1DFD5);	// @ (0x3BFA * 8 + 5)
#define                                 DMA1SSA13_bit       _BIT_ACCESS(DMA1SSAH,5)
// DMA1SSAH<DMA1SSA14>
extern volatile __bit                   DMA1SSA14           __at(0x1DFD6);	// @ (0x3BFA * 8 + 6)
#define                                 DMA1SSA14_bit       _BIT_ACCESS(DMA1SSAH,6)
// DMA1SSAH<DMA1SSA15>
extern volatile __bit                   DMA1SSA15           __at(0x1DFD7);	// @ (0x3BFA * 8 + 7)
#define                                 DMA1SSA15_bit       _BIT_ACCESS(DMA1SSAH,7)
// DMA1SSAU<DMA1SSA16>
extern volatile __bit                   DMA1SSA16           __at(0x1DFD8);	// @ (0x3BFB * 8 + 0)
#define                                 DMA1SSA16_bit       _BIT_ACCESS(DMA1SSAU,0)
// DMA1SSAU<DMA1SSA17>
extern volatile __bit                   DMA1SSA17           __at(0x1DFD9);	// @ (0x3BFB * 8 + 1)
#define                                 DMA1SSA17_bit       _BIT_ACCESS(DMA1SSAU,1)
// DMA1SSAU<DMA1SSA18>
extern volatile __bit                   DMA1SSA18           __at(0x1DFDA);	// @ (0x3BFB * 8 + 2)
#define                                 DMA1SSA18_bit       _BIT_ACCESS(DMA1SSAU,2)
// DMA1SSAU<DMA1SSA19>
extern volatile __bit                   DMA1SSA19           __at(0x1DFDB);	// @ (0x3BFB * 8 + 3)
#define                                 DMA1SSA19_bit       _BIT_ACCESS(DMA1SSAU,3)
// DMA1SSAL<DMA1SSA2>
extern volatile __bit                   DMA1SSA2            __at(0x1DFCA);	// @ (0x3BF9 * 8 + 2)
#define                                 DMA1SSA2_bit        _BIT_ACCESS(DMA1SSAL,2)
// DMA1SSAU<DMA1SSA20>
extern volatile __bit                   DMA1SSA20           __at(0x1DFDC);	// @ (0x3BFB * 8 + 4)
#define                                 DMA1SSA20_bit       _BIT_ACCESS(DMA1SSAU,4)
// DMA1SSAU<DMA1SSA21>
extern volatile __bit                   DMA1SSA21           __at(0x1DFDD);	// @ (0x3BFB * 8 + 5)
#define                                 DMA1SSA21_bit       _BIT_ACCESS(DMA1SSAU,5)
// DMA1SSAL<DMA1SSA3>
extern volatile __bit                   DMA1SSA3            __at(0x1DFCB);	// @ (0x3BF9 * 8 + 3)
#define                                 DMA1SSA3_bit        _BIT_ACCESS(DMA1SSAL,3)
// DMA1SSAL<DMA1SSA4>
extern volatile __bit                   DMA1SSA4            __at(0x1DFCC);	// @ (0x3BF9 * 8 + 4)
#define                                 DMA1SSA4_bit        _BIT_ACCESS(DMA1SSAL,4)
// DMA1SSAL<DMA1SSA5>
extern volatile __bit                   DMA1SSA5            __at(0x1DFCD);	// @ (0x3BF9 * 8 + 5)
#define                                 DMA1SSA5_bit        _BIT_ACCESS(DMA1SSAL,5)
// DMA1SSAL<DMA1SSA6>
extern volatile __bit                   DMA1SSA6            __at(0x1DFCE);	// @ (0x3BF9 * 8 + 6)
#define                                 DMA1SSA6_bit        _BIT_ACCESS(DMA1SSAL,6)
// DMA1SSAL<DMA1SSA7>
extern volatile __bit                   DMA1SSA7            __at(0x1DFCF);	// @ (0x3BF9 * 8 + 7)
#define                                 DMA1SSA7_bit        _BIT_ACCESS(DMA1SSAL,7)
// DMA1SSAH<DMA1SSA8>
extern volatile __bit                   DMA1SSA8            __at(0x1DFD0);	// @ (0x3BFA * 8 + 0)
#define                                 DMA1SSA8_bit        _BIT_ACCESS(DMA1SSAH,0)
// DMA1SSAH<DMA1SSA9>
extern volatile __bit                   DMA1SSA9            __at(0x1DFD1);	// @ (0x3BFA * 8 + 1)
#define                                 DMA1SSA9_bit        _BIT_ACCESS(DMA1SSAH,1)
// DMA1SSZL<DMA1SSZ0>
extern volatile __bit                   DMA1SSZ0            __at(0x1DFB8);	// @ (0x3BF7 * 8 + 0)
#define                                 DMA1SSZ0_bit        _BIT_ACCESS(DMA1SSZL,0)
// DMA1SSZL<DMA1SSZ1>
extern volatile __bit                   DMA1SSZ1            __at(0x1DFB9);	// @ (0x3BF7 * 8 + 1)
#define                                 DMA1SSZ1_bit        _BIT_ACCESS(DMA1SSZL,1)
// DMA1SSZH<DMA1SSZ10>
extern volatile __bit                   DMA1SSZ10           __at(0x1DFC2);	// @ (0x3BF8 * 8 + 2)
#define                                 DMA1SSZ10_bit       _BIT_ACCESS(DMA1SSZH,2)
// DMA1SSZH<DMA1SSZ11>
extern volatile __bit                   DMA1SSZ11           __at(0x1DFC3);	// @ (0x3BF8 * 8 + 3)
#define                                 DMA1SSZ11_bit       _BIT_ACCESS(DMA1SSZH,3)
// DMA1SSZL<DMA1SSZ2>
extern volatile __bit                   DMA1SSZ2            __at(0x1DFBA);	// @ (0x3BF7 * 8 + 2)
#define                                 DMA1SSZ2_bit        _BIT_ACCESS(DMA1SSZL,2)
// DMA1SSZL<DMA1SSZ3>
extern volatile __bit                   DMA1SSZ3            __at(0x1DFBB);	// @ (0x3BF7 * 8 + 3)
#define                                 DMA1SSZ3_bit        _BIT_ACCESS(DMA1SSZL,3)
// DMA1SSZL<DMA1SSZ4>
extern volatile __bit                   DMA1SSZ4            __at(0x1DFBC);	// @ (0x3BF7 * 8 + 4)
#define                                 DMA1SSZ4_bit        _BIT_ACCESS(DMA1SSZL,4)
// DMA1SSZL<DMA1SSZ5>
extern volatile __bit                   DMA1SSZ5            __at(0x1DFBD);	// @ (0x3BF7 * 8 + 5)
#define                                 DMA1SSZ5_bit        _BIT_ACCESS(DMA1SSZL,5)
// DMA1SSZL<DMA1SSZ6>
extern volatile __bit                   DMA1SSZ6            __at(0x1DFBE);	// @ (0x3BF7 * 8 + 6)
#define                                 DMA1SSZ6_bit        _BIT_ACCESS(DMA1SSZL,6)
// DMA1SSZL<DMA1SSZ7>
extern volatile __bit                   DMA1SSZ7            __at(0x1DFBF);	// @ (0x3BF7 * 8 + 7)
#define                                 DMA1SSZ7_bit        _BIT_ACCESS(DMA1SSZL,7)
// DMA1SSZH<DMA1SSZ8>
extern volatile __bit                   DMA1SSZ8            __at(0x1DFC0);	// @ (0x3BF8 * 8 + 0)
#define                                 DMA1SSZ8_bit        _BIT_ACCESS(DMA1SSZH,0)
// DMA1SSZH<DMA1SSZ9>
extern volatile __bit                   DMA1SSZ9            __at(0x1DFC1);	// @ (0x3BF8 * 8 + 1)
#define                                 DMA1SSZ9_bit        _BIT_ACCESS(DMA1SSZH,1)
// DMA1CON0<DMA1XIP>
extern volatile __bit                   DMA1XIP             __at(0x1DFE0);	// @ (0x3BFC * 8 + 0)
#define                                 DMA1XIP_bit         _BIT_ACCESS(DMA1CON0,0)
// PIE5<DMA2AIE>
extern volatile __bit                   DMA2AIE             __at(0x1CCAD);	// @ (0x3995 * 8 + 5)
#define                                 DMA2AIE_bit         _BIT_ACCESS(PIE5,5)
// PIR5<DMA2AIF>
extern volatile __bit                   DMA2AIF             __at(0x1CD2D);	// @ (0x39A5 * 8 + 5)
#define                                 DMA2AIF_bit         _BIT_ACCESS(PIR5,5)
// IPR5<DMA2AIP>
extern volatile __bit                   DMA2AIP             __at(0x1CC2D);	// @ (0x3985 * 8 + 5)
#define                                 DMA2AIP_bit         _BIT_ACCESS(IPR5,5)
// DMA2AIRQ<DMA2AIRQ0>
extern volatile __bit                   DMA2AIRQ0           __at(0x1DEF0);	// @ (0x3BDE * 8 + 0)
#define                                 DMA2AIRQ0_bit       _BIT_ACCESS(DMA2AIRQ,0)
// DMA2AIRQ<DMA2AIRQ1>
extern volatile __bit                   DMA2AIRQ1           __at(0x1DEF1);	// @ (0x3BDE * 8 + 1)
#define                                 DMA2AIRQ1_bit       _BIT_ACCESS(DMA2AIRQ,1)
// DMA2AIRQ<DMA2AIRQ2>
extern volatile __bit                   DMA2AIRQ2           __at(0x1DEF2);	// @ (0x3BDE * 8 + 2)
#define                                 DMA2AIRQ2_bit       _BIT_ACCESS(DMA2AIRQ,2)
// DMA2AIRQ<DMA2AIRQ3>
extern volatile __bit                   DMA2AIRQ3           __at(0x1DEF3);	// @ (0x3BDE * 8 + 3)
#define                                 DMA2AIRQ3_bit       _BIT_ACCESS(DMA2AIRQ,3)
// DMA2AIRQ<DMA2AIRQ4>
extern volatile __bit                   DMA2AIRQ4           __at(0x1DEF4);	// @ (0x3BDE * 8 + 4)
#define                                 DMA2AIRQ4_bit       _BIT_ACCESS(DMA2AIRQ,4)
// DMA2AIRQ<DMA2AIRQ5>
extern volatile __bit                   DMA2AIRQ5           __at(0x1DEF5);	// @ (0x3BDE * 8 + 5)
#define                                 DMA2AIRQ5_bit       _BIT_ACCESS(DMA2AIRQ,5)
// DMA2AIRQ<DMA2AIRQ6>
extern volatile __bit                   DMA2AIRQ6           __at(0x1DEF6);	// @ (0x3BDE * 8 + 6)
#define                                 DMA2AIRQ6_bit       _BIT_ACCESS(DMA2AIRQ,6)
// DMA2CON0<DMA2AIRQEN>
extern volatile __bit                   DMA2AIRQEN          __at(0x1DEE2);	// @ (0x3BDC * 8 + 2)
#define                                 DMA2AIRQEN_bit      _BIT_ACCESS(DMA2CON0,2)
// DMA2BUF<DMA2BUF0>
extern volatile __bit                   DMA2BUF0            __at(0x1DE48);	// @ (0x3BC9 * 8 + 0)
#define                                 DMA2BUF0_bit        _BIT_ACCESS(DMA2BUF,0)
// DMA2BUF<DMA2BUF1>
extern volatile __bit                   DMA2BUF1            __at(0x1DE49);	// @ (0x3BC9 * 8 + 1)
#define                                 DMA2BUF1_bit        _BIT_ACCESS(DMA2BUF,1)
// DMA2BUF<DMA2BUF2>
extern volatile __bit                   DMA2BUF2            __at(0x1DE4A);	// @ (0x3BC9 * 8 + 2)
#define                                 DMA2BUF2_bit        _BIT_ACCESS(DMA2BUF,2)
// DMA2BUF<DMA2BUF3>
extern volatile __bit                   DMA2BUF3            __at(0x1DE4B);	// @ (0x3BC9 * 8 + 3)
#define                                 DMA2BUF3_bit        _BIT_ACCESS(DMA2BUF,3)
// DMA2BUF<DMA2BUF4>
extern volatile __bit                   DMA2BUF4            __at(0x1DE4C);	// @ (0x3BC9 * 8 + 4)
#define                                 DMA2BUF4_bit        _BIT_ACCESS(DMA2BUF,4)
// DMA2BUF<DMA2BUF5>
extern volatile __bit                   DMA2BUF5            __at(0x1DE4D);	// @ (0x3BC9 * 8 + 5)
#define                                 DMA2BUF5_bit        _BIT_ACCESS(DMA2BUF,5)
// DMA2BUF<DMA2BUF6>
extern volatile __bit                   DMA2BUF6            __at(0x1DE4E);	// @ (0x3BC9 * 8 + 6)
#define                                 DMA2BUF6_bit        _BIT_ACCESS(DMA2BUF,6)
// DMA2BUF<DMA2BUF7>
extern volatile __bit                   DMA2BUF7            __at(0x1DE4F);	// @ (0x3BC9 * 8 + 7)
#define                                 DMA2BUF7_bit        _BIT_ACCESS(DMA2BUF,7)
// DMA2DCNTL<DMA2DCNT0>
extern volatile __bit                   DMA2DCNT0           __at(0x1DE50);	// @ (0x3BCA * 8 + 0)
#define                                 DMA2DCNT0_bit       _BIT_ACCESS(DMA2DCNTL,0)
// DMA2DCNTL<DMA2DCNT1>
extern volatile __bit                   DMA2DCNT1           __at(0x1DE51);	// @ (0x3BCA * 8 + 1)
#define                                 DMA2DCNT1_bit       _BIT_ACCESS(DMA2DCNTL,1)
// DMA2DCNTH<DMA2DCNT10>
extern volatile __bit                   DMA2DCNT10          __at(0x1DE5A);	// @ (0x3BCB * 8 + 2)
#define                                 DMA2DCNT10_bit      _BIT_ACCESS(DMA2DCNTH,2)
// DMA2DCNTH<DMA2DCNT11>
extern volatile __bit                   DMA2DCNT11          __at(0x1DE5B);	// @ (0x3BCB * 8 + 3)
#define                                 DMA2DCNT11_bit      _BIT_ACCESS(DMA2DCNTH,3)
// DMA2DCNTL<DMA2DCNT2>
extern volatile __bit                   DMA2DCNT2           __at(0x1DE52);	// @ (0x3BCA * 8 + 2)
#define                                 DMA2DCNT2_bit       _BIT_ACCESS(DMA2DCNTL,2)
// DMA2DCNTL<DMA2DCNT3>
extern volatile __bit                   DMA2DCNT3           __at(0x1DE53);	// @ (0x3BCA * 8 + 3)
#define                                 DMA2DCNT3_bit       _BIT_ACCESS(DMA2DCNTL,3)
// DMA2DCNTL<DMA2DCNT4>
extern volatile __bit                   DMA2DCNT4           __at(0x1DE54);	// @ (0x3BCA * 8 + 4)
#define                                 DMA2DCNT4_bit       _BIT_ACCESS(DMA2DCNTL,4)
// DMA2DCNTL<DMA2DCNT5>
extern volatile __bit                   DMA2DCNT5           __at(0x1DE55);	// @ (0x3BCA * 8 + 5)
#define                                 DMA2DCNT5_bit       _BIT_ACCESS(DMA2DCNTL,5)
// DMA2DCNTL<DMA2DCNT6>
extern volatile __bit                   DMA2DCNT6           __at(0x1DE56);	// @ (0x3BCA * 8 + 6)
#define                                 DMA2DCNT6_bit       _BIT_ACCESS(DMA2DCNTL,6)
// DMA2DCNTL<DMA2DCNT7>
extern volatile __bit                   DMA2DCNT7           __at(0x1DE57);	// @ (0x3BCA * 8 + 7)
#define                                 DMA2DCNT7_bit       _BIT_ACCESS(DMA2DCNTL,7)
// DMA2DCNTH<DMA2DCNT8>
extern volatile __bit                   DMA2DCNT8           __at(0x1DE58);	// @ (0x3BCB * 8 + 0)
#define                                 DMA2DCNT8_bit       _BIT_ACCESS(DMA2DCNTH,0)
// DMA2DCNTH<DMA2DCNT9>
extern volatile __bit                   DMA2DCNT9           __at(0x1DE59);	// @ (0x3BCB * 8 + 1)
#define                                 DMA2DCNT9_bit       _BIT_ACCESS(DMA2DCNTH,1)
// PIE5<DMA2DCNTIE>
extern volatile __bit                   DMA2DCNTIE          __at(0x1CCAB);	// @ (0x3995 * 8 + 3)
#define                                 DMA2DCNTIE_bit      _BIT_ACCESS(PIE5,3)
// PIR5<DMA2DCNTIF>
extern volatile __bit                   DMA2DCNTIF          __at(0x1CD2B);	// @ (0x39A5 * 8 + 3)
#define                                 DMA2DCNTIF_bit      _BIT_ACCESS(PIR5,3)
// IPR5<DMA2DCNTIP>
extern volatile __bit                   DMA2DCNTIP          __at(0x1CC2B);	// @ (0x3985 * 8 + 3)
#define                                 DMA2DCNTIP_bit      _BIT_ACCESS(IPR5,3)
// DMA2CON0<DMA2DGO>
extern volatile __bit                   DMA2DGO             __at(0x1DEE5);	// @ (0x3BDC * 8 + 5)
#define                                 DMA2DGO_bit         _BIT_ACCESS(DMA2CON0,5)
// DMA2DPTRL<DMA2DPTR0>
extern volatile __bit                   DMA2DPTR0           __at(0x1DE60);	// @ (0x3BCC * 8 + 0)
#define                                 DMA2DPTR0_bit       _BIT_ACCESS(DMA2DPTRL,0)
// DMA2DPTRL<DMA2DPTR1>
extern volatile __bit                   DMA2DPTR1           __at(0x1DE61);	// @ (0x3BCC * 8 + 1)
#define                                 DMA2DPTR1_bit       _BIT_ACCESS(DMA2DPTRL,1)
// DMA2DPTRH<DMA2DPTR10>
extern volatile __bit                   DMA2DPTR10          __at(0x1DE6A);	// @ (0x3BCD * 8 + 2)
#define                                 DMA2DPTR10_bit      _BIT_ACCESS(DMA2DPTRH,2)
// DMA2DPTRH<DMA2DPTR11>
extern volatile __bit                   DMA2DPTR11          __at(0x1DE6B);	// @ (0x3BCD * 8 + 3)
#define                                 DMA2DPTR11_bit      _BIT_ACCESS(DMA2DPTRH,3)
// DMA2DPTRH<DMA2DPTR12>
extern volatile __bit                   DMA2DPTR12          __at(0x1DE6C);	// @ (0x3BCD * 8 + 4)
#define                                 DMA2DPTR12_bit      _BIT_ACCESS(DMA2DPTRH,4)
// DMA2DPTRH<DMA2DPTR13>
extern volatile __bit                   DMA2DPTR13          __at(0x1DE6D);	// @ (0x3BCD * 8 + 5)
#define                                 DMA2DPTR13_bit      _BIT_ACCESS(DMA2DPTRH,5)
// DMA2DPTRH<DMA2DPTR14>
extern volatile __bit                   DMA2DPTR14          __at(0x1DE6E);	// @ (0x3BCD * 8 + 6)
#define                                 DMA2DPTR14_bit      _BIT_ACCESS(DMA2DPTRH,6)
// DMA2DPTRH<DMA2DPTR15>
extern volatile __bit                   DMA2DPTR15          __at(0x1DE6F);	// @ (0x3BCD * 8 + 7)
#define                                 DMA2DPTR15_bit      _BIT_ACCESS(DMA2DPTRH,7)
// DMA2DPTRL<DMA2DPTR2>
extern volatile __bit                   DMA2DPTR2           __at(0x1DE62);	// @ (0x3BCC * 8 + 2)
#define                                 DMA2DPTR2_bit       _BIT_ACCESS(DMA2DPTRL,2)
// DMA2DPTRL<DMA2DPTR3>
extern volatile __bit                   DMA2DPTR3           __at(0x1DE63);	// @ (0x3BCC * 8 + 3)
#define                                 DMA2DPTR3_bit       _BIT_ACCESS(DMA2DPTRL,3)
// DMA2DPTRL<DMA2DPTR4>
extern volatile __bit                   DMA2DPTR4           __at(0x1DE64);	// @ (0x3BCC * 8 + 4)
#define                                 DMA2DPTR4_bit       _BIT_ACCESS(DMA2DPTRL,4)
// DMA2DPTRL<DMA2DPTR5>
extern volatile __bit                   DMA2DPTR5           __at(0x1DE65);	// @ (0x3BCC * 8 + 5)
#define                                 DMA2DPTR5_bit       _BIT_ACCESS(DMA2DPTRL,5)
// DMA2DPTRL<DMA2DPTR6>
extern volatile __bit                   DMA2DPTR6           __at(0x1DE66);	// @ (0x3BCC * 8 + 6)
#define                                 DMA2DPTR6_bit       _BIT_ACCESS(DMA2DPTRL,6)
// DMA2DPTRL<DMA2DPTR7>
extern volatile __bit                   DMA2DPTR7           __at(0x1DE67);	// @ (0x3BCC * 8 + 7)
#define                                 DMA2DPTR7_bit       _BIT_ACCESS(DMA2DPTRL,7)
// DMA2DPTRH<DMA2DPTR8>
extern volatile __bit                   DMA2DPTR8           __at(0x1DE68);	// @ (0x3BCD * 8 + 0)
#define                                 DMA2DPTR8_bit       _BIT_ACCESS(DMA2DPTRH,0)
// DMA2DPTRH<DMA2DPTR9>
extern volatile __bit                   DMA2DPTR9           __at(0x1DE69);	// @ (0x3BCD * 8 + 1)
#define                                 DMA2DPTR9_bit       _BIT_ACCESS(DMA2DPTRH,1)
// DMA2DSAL<DMA2DSA0>
extern volatile __bit                   DMA2DSA0            __at(0x1DE80);	// @ (0x3BD0 * 8 + 0)
#define                                 DMA2DSA0_bit        _BIT_ACCESS(DMA2DSAL,0)
// DMA2DSAL<DMA2DSA1>
extern volatile __bit                   DMA2DSA1            __at(0x1DE81);	// @ (0x3BD0 * 8 + 1)
#define                                 DMA2DSA1_bit        _BIT_ACCESS(DMA2DSAL,1)
// DMA2DSAH<DMA2DSA10>
extern volatile __bit                   DMA2DSA10           __at(0x1DE8A);	// @ (0x3BD1 * 8 + 2)
#define                                 DMA2DSA10_bit       _BIT_ACCESS(DMA2DSAH,2)
// DMA2DSAH<DMA2DSA11>
extern volatile __bit                   DMA2DSA11           __at(0x1DE8B);	// @ (0x3BD1 * 8 + 3)
#define                                 DMA2DSA11_bit       _BIT_ACCESS(DMA2DSAH,3)
// DMA2DSAH<DMA2DSA12>
extern volatile __bit                   DMA2DSA12           __at(0x1DE8C);	// @ (0x3BD1 * 8 + 4)
#define                                 DMA2DSA12_bit       _BIT_ACCESS(DMA2DSAH,4)
// DMA2DSAH<DMA2DSA13>
extern volatile __bit                   DMA2DSA13           __at(0x1DE8D);	// @ (0x3BD1 * 8 + 5)
#define                                 DMA2DSA13_bit       _BIT_ACCESS(DMA2DSAH,5)
// DMA2DSAH<DMA2DSA14>
extern volatile __bit                   DMA2DSA14           __at(0x1DE8E);	// @ (0x3BD1 * 8 + 6)
#define                                 DMA2DSA14_bit       _BIT_ACCESS(DMA2DSAH,6)
// DMA2DSAH<DMA2DSA15>
extern volatile __bit                   DMA2DSA15           __at(0x1DE8F);	// @ (0x3BD1 * 8 + 7)
#define                                 DMA2DSA15_bit       _BIT_ACCESS(DMA2DSAH,7)
// DMA2DSAL<DMA2DSA2>
extern volatile __bit                   DMA2DSA2            __at(0x1DE82);	// @ (0x3BD0 * 8 + 2)
#define                                 DMA2DSA2_bit        _BIT_ACCESS(DMA2DSAL,2)
// DMA2DSAL<DMA2DSA3>
extern volatile __bit                   DMA2DSA3            __at(0x1DE83);	// @ (0x3BD0 * 8 + 3)
#define                                 DMA2DSA3_bit        _BIT_ACCESS(DMA2DSAL,3)
// DMA2DSAL<DMA2DSA4>
extern volatile __bit                   DMA2DSA4            __at(0x1DE84);	// @ (0x3BD0 * 8 + 4)
#define                                 DMA2DSA4_bit        _BIT_ACCESS(DMA2DSAL,4)
// DMA2DSAL<DMA2DSA5>
extern volatile __bit                   DMA2DSA5            __at(0x1DE85);	// @ (0x3BD0 * 8 + 5)
#define                                 DMA2DSA5_bit        _BIT_ACCESS(DMA2DSAL,5)
// DMA2DSAL<DMA2DSA6>
extern volatile __bit                   DMA2DSA6            __at(0x1DE86);	// @ (0x3BD0 * 8 + 6)
#define                                 DMA2DSA6_bit        _BIT_ACCESS(DMA2DSAL,6)
// DMA2DSAL<DMA2DSA7>
extern volatile __bit                   DMA2DSA7            __at(0x1DE87);	// @ (0x3BD0 * 8 + 7)
#define                                 DMA2DSA7_bit        _BIT_ACCESS(DMA2DSAL,7)
// DMA2DSAH<DMA2DSA8>
extern volatile __bit                   DMA2DSA8            __at(0x1DE88);	// @ (0x3BD1 * 8 + 0)
#define                                 DMA2DSA8_bit        _BIT_ACCESS(DMA2DSAH,0)
// DMA2DSAH<DMA2DSA9>
extern volatile __bit                   DMA2DSA9            __at(0x1DE89);	// @ (0x3BD1 * 8 + 1)
#define                                 DMA2DSA9_bit        _BIT_ACCESS(DMA2DSAH,1)
// DMA2DSZL<DMA2DSZ0>
extern volatile __bit                   DMA2DSZ0            __at(0x1DE70);	// @ (0x3BCE * 8 + 0)
#define                                 DMA2DSZ0_bit        _BIT_ACCESS(DMA2DSZL,0)
// DMA2DSZL<DMA2DSZ1>
extern volatile __bit                   DMA2DSZ1            __at(0x1DE71);	// @ (0x3BCE * 8 + 1)
#define                                 DMA2DSZ1_bit        _BIT_ACCESS(DMA2DSZL,1)
// DMA2DSZH<DMA2DSZ10>
extern volatile __bit                   DMA2DSZ10           __at(0x1DE7A);	// @ (0x3BCF * 8 + 2)
#define                                 DMA2DSZ10_bit       _BIT_ACCESS(DMA2DSZH,2)
// DMA2DSZH<DMA2DSZ11>
extern volatile __bit                   DMA2DSZ11           __at(0x1DE7B);	// @ (0x3BCF * 8 + 3)
#define                                 DMA2DSZ11_bit       _BIT_ACCESS(DMA2DSZH,3)
// DMA2DSZL<DMA2DSZ2>
extern volatile __bit                   DMA2DSZ2            __at(0x1DE72);	// @ (0x3BCE * 8 + 2)
#define                                 DMA2DSZ2_bit        _BIT_ACCESS(DMA2DSZL,2)
// DMA2DSZL<DMA2DSZ3>
